---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntry.Dispose
source: html/1facc428-7054-9be5-1e69-bf15f10be55b.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntry.Dispose Method

Releases all resources used by the KeyBasedTreeEntry

## Syntax (C#)
```csharp
public void Dispose()
```